{"_id":{"$oid":"61e4b914c4949e031cdbe113"},"Title":"Pulp Fiction","Description":"Two hitmen get involved with a powerful gangster, his overdosing girlfriend, and a desperate boxer in a chain of violence and redemption.","Genre":{"Name":"Comedy Drama","Description":"Comedy Drama is a genre of film that emphasizes humor combined with serious content, such as high stakes and a lot of conflict."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino is an American filmmaker, director, screenwriter, producer, and actor. His films are known for their dark humor, stylized violence, and nonlinear storylines.","Birth":"1963"},"ImagePath":"pulpfiction.png","Featured":true}
{"_id":{"$oid":"61e4c274c4949e031cdbe114"},"Title":"The Grand Budapest Hotel","Description":"The owner of an aging high-class hotel retells his early life adventures serving as the hotel's concierge with a lobby boy who becomes his closest confidant. The story involves the theft and recovery of a renaissance painting, and a tense battle of a large family fortune, all in the midst of a growing facist regime.","Genre":{"Name":"Comedy Drama","Description":"Comedy Drama is a genre of film that emphasizes humor combined with serious content, such as high stakes and a lot of conflict."},"Director":{"Name":"Wes Anderson","Bio":"Wes Anderson is an American indie filmmaker, producer, and director. His films are famous for their unconventionality and unique visual and narrative styles.","Birth":"1969"},"ImagePath":"thegrandbudapesthotel.png","Featured":true}
{"_id":{"$oid":"61e4c658c4949e031cdbe115"},"Title":"The Lord of the Rings: The Return of the King","Description":"Continuing the plot of The Fellowship of the Ring, and The Two Towers, Frodo, Sam, and Gollum venture to Mordor to destroy the One Ring. Gandalf and Aragorn lead their joining forces against Sauron's evil army in Minas Tirith.","Genre":{"Name":"Fantasy Adventure","Description":"Fantasy Adventure is a genre of film where characters are involved in an exciting journey that usually involves fantastic themes, mythical places, magic, folklore, or supernatural events."},"Director":{"Name":"Peter Jackson","Bio":"Peter Jackson is a New Zealand film director, screenwriter, and film producer. He is best known for the Lord of the Rings trilogy and the Hobbit trilogy.","Birth":"1961"},"ImagePath":"thelordoftheringsthereturnoftheking.png","Featured":true}
{"_id":{"$oid":"61e4ca3fc4949e031cdbe117"},"Title":"Inception","Description":"A theif uses technology to enter people's dreams to steal corporate secrets. He is given the task of planting an idea in the mind of a CEO, but his tragic past may sabatoge the project and put his team at risk.","Genre":{"Name":"Sci-Fi","Description":"Sci-Fi is a genre of film that involves fictional scientific phenomena that typically involves imaginative and futuristic concepts and technology."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films are based on epistemological and metaphysical ideas.","Birth":"1970"},"ImagePath":"inception.png","Featured":true}
{"_id":{"$oid":"61e4cd34c4949e031cdbe118"},"Title":"Eternal Sunshine of the Spotless Mind","Description":"Clementine experiences a painful breakup and undergoes a memory erasing procedure to forget her boyfriend Joel. Joel is shocked to discover this, so he undergoes the same procedure. As he slowly starts to forget the woman he loved, he desperately tries to stop the procedure.","Genre":{"Name":"Romantic Sci-Fi","Description":"Romantic Sci-Fi is a genre of film that involves fictional scientific phenomena with a love story."},"Director":{"Name":"Michel Gondry","Bio":"Michel Gondry is a French film director, screenwriter, and producer. He is known for his creative visual style among his fantasy and comedy movies.","Birth":"1963"},"ImagePath":"eternalsunshineofthespotlessmind.png","Featured":true}
{"_id":{"$oid":"61e4cf41c4949e031cdbe119"},"Title":"The Shining","Description":"Based on Stephen King's novel, an aspiring writer and recovering alcoholic, Jack Torrance, takes a job as a winter caretaker of an off-season hotel, with his wife, Wendy, and young Son, Danny. Danny is gifted with abilities to see the hotel's horrific past. As they are trapped in by the snowstorms, Jack starts to lose his sanity due to the sinister forces controlling the hotel.","Genre":{"Name":"Horror","Description":"Horror is a genre of film involving disturbing and dark content that is meant to elicit fear, terror, shock, and disgust."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was an American film director, producer, screenwriter, and photographer. Most of his films were depictions of novels. He is often said to be one of the greatest filmmakers in cinematic history.","Birth":"1928","Death":"1999"},"ImagePath":"theshining.png","Featured":true}
{"_id":{"$oid":"61e4d111c4949e031cdbe11a"},"Title":"Toy Story","Description":"An animated story about a secret life of a young boy's toys that come alive when humans are not around. A good-hearted cowboy doll is threatened by his boy's new spaceman action figure who does not believe he is a toy. During the family's move, the toys accidentally escape and they must find their way back to their boy.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film that emphasizes humor and is meant to make the audience laugh."},"Director":{"Name":"John Lasseter","Bio":"John Lasseter is an American film director, producer, screenwriter, animator, and voice actor. He was previously the chief creative officer of Pixar Animation Studios and is currently the head of Skydance Animation.","Birth":"1957"},"ImagePath":"toystory.png","Featured":true}
{"_id":{"$oid":"61e4d2c3c4949e031cdbe11b"},"Title":"Mean Girls","Description":"Teenager Cady Heron was homeschooled in Africa by her scientist parents until she moves to the suburbs of Illinois. She experiences the cruel social hierarchy of a modern American high school and gets involved with a shallow clique of girls known as 'The Plastics'.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film that emphasizes humor and is meant to make the audience laugh."},"Director":{"Name":"Mark Waters","Bio":"Mark Waters is an American screenwriter, director, and film producer best known for his mainstream comedy films.","Birth":"1964"},"ImagePath":"meangirls.png","Featured":true}
{"_id":{"$oid":"61e4d551c4949e031cdbe11c"},"Title":"Harry Potter and the Prisoner of Azkaban","Description":"Continuing the Harry Potter series, it is Harry's third year at Hogwarts and a mad killer, Sirius Black, has escaped from the Azkaban prison to kill the young wizard. Harry is on a quest to uncover the truth of his past that includes a connection between Black and his late parents.","Genre":{"Name":"Fantasy Adventure","Description":"Fantasy Adventure is a genre of film that where characters are involved in an exciting journey that usually involves fantastic themes, mythical places, magic, folklore, or supernatural events."},"Director":{"Name":"Alfonso Cuaron","Bio":"Alfonso Cuaron is a Mexican film director, film producer, screenwriter, cinematographer, and film editor. He is the first Mexico-born filmmaker to win the Academy Award for Best Director.","Birth":"1961"},"ImagePath":"harrypotterandtheprisonerofazkaban.png","Featured":true}
{"_id":{"$oid":"61e4d808c4949e031cdbe11d"},"Title":"Inglourious Basterds","Description":"During Germany's occupation of France, allied officer, Lt. Aldo Raine, builds a team of Jewish soldiers to commit acts of violence against the Nazis as a form of punishment. They join forces with a German actress and undercover agent to take down the leaders of the Third Reich.","Genre":{"Name":"Comedy Drama","Description":"Comedy Drama is a genre of film that emphasizes humor combined with serious content such as high stakes and a lot of conflict."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino is an American filmmaker, director, screenwriter, producer, and actor. His films are known for their dark humor, stylized violence, and nonlinear storylines.","Birth":"1963"},"ImagePath":"inglouriousbasterds.png","Featured":true}
